CSI API ETABS v1
cDesignCompositeColumn.SetDesignSection Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDesignSection(
	string Name,
	string PropName,
	bool LastAnalysis,
	eItemType ItemType = eItemType.Objects
)
Function SetDesignSection (
	Name As String,
	PropName As String,
	LastAnalysis As Boolean,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignCompositeColumn
Dim Name As String
Dim PropName As String
Dim LastAnalysis As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetDesignSection(Name,
	PropName, LastAnalysis, ItemType)
int SetDesignSection(
	String^ Name,
	String^ PropName,
	bool LastAnalysis,
	eItemType ItemType = eItemType::Objects
)
abstract SetDesignSection :
        Name : string *
        PropName : string *
        LastAnalysis : bool *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
PropName
Type: System.String
LastAnalysis
Type: System.Boolean
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cDesignCompositeColumn Interface
ETABSv1 Namespace